In [5]:
import pandas as pd
athletes = pd.read_csv('./pandas/athletes_clean.csv')
athletes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11538 entries, 0 to 11537
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             11538 non-null  int64
 1   name           11538 non-null  object
 2   nationality    11538 non-null  object
 3   sex            11538 non-null  object
 4   date_of_birth  11538 non-null  object
 5   height         11208 non-null  float64
 6   weight         10879 non-null  float64
 7   sport          11538 non-null  object
 8   gold           11538 non-null  int64
 9   silver         11538 non-null  int64
 10  bronze         11538 non-null  int64
 11  info           131 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 1.1+ MB

In [7]:
g = athletes.groupby('nationality')

In [8]:
g.sum() #the index becomes the group by argument

                      id  height  weight  gold  silver  bronze
nationality
AFG            544720346    5.21   222.0     0       0       0
ALB           3224936557   10.57   404.0     0       0       0
ALG          34523048655  119.43  4219.0     0       2       0
AND           3059131853    8.56   320.0     0       0       0
ANG          10511499494   45.82  1907.0     0       0       0
...                  ...     ...     ...   ...     ...     ...
VIE          10541691287   38.27  1360.0     1       1       0
VIN           2891918513    3.51   120.0     0       0       0
YEM           2482979326    5.09   194.0     0       0       0
ZAM           3000084717   10.60   405.0     0       0       0
ZIM          17589703247   58.66  2193.0     0       0       0

[207 rows x 6 columns]

In [9]:
g.sum()[['gold', 'silver', 'bronze']]

             gold  silver  bronze
nationality
AFG             0       0       0
ALB             0       0       0
ALG             0       2       0
AND             0       0       0
ANG             0       0       0
...           ...     ...     ...
VIE             1       1       0
VIN             0       0       0
YEM             0       0       0
ZAM             0       0       0
ZIM             0       0       0

[207 rows x 3 columns]

In [10]:
g= athletes.groupby('nationality')[['gold', 'silver', 'bronze']]
g.sum()

             gold  silver  bronze
nationality
AFG             0       0       0
ALB             0       0       0
ALG             0       2       0
AND             0       0       0
ANG             0       0       0
...           ...     ...     ...
VIE             1       1       0
VIN             0       0       0
YEM             0       0       0
ZAM             0       0       0
ZIM             0       0       0

[207 rows x 3 columns]

In [16]:
g= athletes.groupby(['sport', 'sex'])['weight', 'height']

<ipython-input-16-824c01e49d50>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  g= athletes.groupby(['sport', 'sex'])['weight', 'height']

In [17]:
g.mean()

                              weight    height
sport             sex
aquatics          female   62.284483  1.715712
                  male     82.219061  1.860342
archery           female   64.301587  1.676190
                  male     80.079365  1.795714
athletics         female   60.152542  1.690500
                  male     74.777680  1.809234
badminton         female   61.209877  1.686000
                  male     76.156627  1.805059
basketball        female   75.377622  1.833819
                  male    100.297872  2.003611
boxing            female         NaN  1.682222
                  male           NaN  1.757615
canoe             female   66.457944  1.700648
                  male     82.150000  1.820455
cycling           female   60.207254  1.673128
                  male     72.576052  1.793074
equestrian        female   58.634146  1.682530
                  male     72.954887  1.790000
fencing           female   62.733871  1.712581
                  male     78.785124  1.833802
football          female   61.061069  1.682710
                  male     74.451713  1.793746
golf              female   63.200000  1.691404
                  male     79.000000  1.793500
gymnastics        female   49.555024  1.616524
                  male     63.254545  1.677105
handball          female   70.789157  1.759722
                  male     95.431694  1.913169
hockey            female   60.425926  1.667870
                  male     77.375000  1.800093
judo              female   65.392157  1.665132
                  male     84.616740  1.781783
modern pentathlon female   58.000000  1.699444
                  male     73.916667  1.825278
rowing            female   69.776190  1.773286
                  male     86.504615  1.898708
rugby sevens      female   66.595890  1.678552
                  male     90.450331  1.829145
sailing           female   63.194969  1.692767
                  male     77.122066  1.812770
shooting          female   62.675676  1.648400
                  male     81.068966  1.780343
table tennis      female   57.530120  1.653659
                  male     72.558140  1.786860
taekwondo         female   61.258065  1.730159
                  male     74.809524  1.863750
tennis            female   64.670455  1.734205
                  male     80.417476  1.860388
triathlon         female   54.563636  1.676545
                  male     66.814815  1.788704
volleyball        female   70.684211  1.828691
                  male     89.421875  1.964010
weightlifting     female   68.788462  1.603558
                  male     87.538961  1.709221
wrestling         female   61.805310  1.651239
                  male     85.372881  1.757215